sulaolab/dspic33ck-hal-lab/src/boards/ev88g73a/main.c
/*
 * dsPIC33CK64MC105 / EV88G73A first runnable profile.
 *
 * The EV88G73A board is the dsPIC33CK64MC105 Curiosity Nano. This profile uses
 * only board facts confirmed from the user guide: LED0 on RD10 (active-low) and
 * the on-board debugger CDC UART on U1 TX/RX through RC10/RP58 and RC11/RP59.
 */

#include <stdint.h>
#include <xc.h>

#include <stdbool.h>

#include "ev88g73a_board.h"   /* bring-up + the operating point it reached */
#include "ev88g73a_io.h"      /* LED0, SW0 */
#include "profile_main.h"

/* The running time. Every "every N ms" in this file is expressed against GetTicks(),
 * and this profile is what starts the tick -- from Fcy, deliberately, so that the LED
 * cycle stays a live check on the operating point. See app/timer_app.h. */
#include "timer_app.h"

/* The banner and every other print in this file go through the console seam. This
 * board no longer has a UART API of its own to call -- see ev88g73a_board.h. */
#include "console_out.h"
#include "nora_uart.h"   /* nora_uart_get_baudrate() for the banner */

/* Generated per build into build/<variant>/production/generated/ by
 * buildtools/build.ps1, which also defines EV88G73A_HAVE_BUILD_ID_H. Absent for
 * builds made any other way -- the banner then says so rather than lying. */
#if defined(EV88G73A_HAVE_BUILD_ID_H)
#include "ev88g73a_build_id.h"
#endif

#ifndef DSPIC33CK_BOARD_EV88G73A
#error "boards/ev88g73a/main.c is EV88G73A-owned. Build it only in the CK64MC105_EV88G73A configuration -- if it reached another one, fix the <item ex=...> exclusions in firmware.X/nbproject/configurations.xml."
#endif

/* THE PROFILE'S ANSWERS, FIRST: app_config.h pulls in this board's board_profile.h and
 * refuses anything unresolved, so every DEMO_ENABLE_ and BOARD_CONSOLE_ switch below is
 * decided before the first conditional include that reads one. See the block further down for what
 * this replaced (two vocabularies for one decision). */
#include "app_config.h"

/* DEMO_ENABLE_CONSOLE_COMMANDS is 1 in this board's board_profile.h and always has been in
 * effect: the console is what provides the software-reset command, and a board with no reset
 * button needs that in every build. It is a switch rather than an unconditional include
 * because the OTHER profile does not have it yet, and a capability that one board simply
 * lacks should be visible as a 0 somewhere rather than as an absence of code (see
 * boards/dm330030/board_profile.h and the parity contract).
 * Shared -- this was ev88g73a_console.h, whose contents needed no board knowledge at all. */
#if DEMO_ENABLE_CONSOLE_COMMANDS
#include "console_task.h"
#endif

/* Unconditional for the same reason as the console: a trap that goes unreported
 * is indistinguishable from a dead board, which is the failure mode this profile
 * has already been bitten by. See app/app_traps.h.
 *
 * Also the home of the BOARD SEAM, hence board_reset_cause_str() for the banner's Reset
 * line -- the same name the shared *rc console command uses, this board having no
 * reset-cause function of its own any more (see ev88g73a_board.h). */
#include "app_traps.h"

/* -------------------------------------------------------------------------- */
/* WHICH EXERCISERS THIS PROFILE RUNS -- ANSWERED IN board_profile.h.           */
/*                                                                            */
/* The values used to be defined here as EV88G73A_ENABLE_*, while DM330030      */
/* answered the same questions as ENA_* in app/app_config.h: two vocabularies    */
/* for one decision, and a TDM loopback build had to pass BOTH spellings         */
/* because the shared module reads app_config.h and cannot see a #define made    */
/* in this file. Since 2026-08-05 there is one name per decision, resolved in     */
/* boards/ev88g73a/board_profile.h, and app/app_config.h refuses anything        */
/* unresolved or contradictory rather than silently building a 0.                */
/*                                                                            */
/* So this file now READS the switches and never sets them. What stays here is   */
/* the reasoning that belongs next to the code each one selects; the defaults     */
/* and the board's own answers are one file away.                               */
/* -------------------------------------------------------------------------- */

/*
 * DEMO_ENABLE_WM8904_AUDIO -- the audio path: a single WM8904 codec, in the default build
 * the audio-clock master at 48 000 Hz (jumper A-XTAL) with dsPIC SPI1 as a TDM8/32-bit
 * SLAVE; EV88G73A_WM8904_DSPIC_IS_MASTER=1 swaps that (see the note beside the switch
 * below). This firmware supplies no MCLK in either direction. Passthrough audio (line-in -> WM8904 ADC -> dsPIC -> WM8904 DAC ->
 * headphone). Claims SPI1/RP48-51 and I2C1/RP56-57. The path itself is shared --
 * app/wm8904_audio.h -- and this board's half of it is the port struct below plus
 * ev88g73a_tdm_pins_init()/ev88g73a_i2c1_init() from ev88g73a_board.h.
 *
 * Default 1: the codec is what this board is for, and it is the only audio path left.
 * Set to 0 for the LED/UART/console baseline with no audio at all.
 *
 * TWO EXERCISERS USED TO BE SELECTED HERE AND BOTH ARE GONE. Recording them because the
 * flags they were selected with are the reason this block looks the way it does:
 *
 *   EV88G73A_ENABLE_SPI_DMA_MIN (deleted 2026-08-01) -- stage A of the SPI/DMA core
 *     rebuild: minimal 16-bit unframed SPI + DMA poking registers directly, to isolate
 *     faults before the transport core existed.
 *   EV88G73A_ENABLE_TDM_LOOPBACK (deleted 2026-08-02) -- TDM8/32-bit framed master
 *     loopback through the shared transport core, with CLC1 50%-duty FS. Streamed
 *     cleanly on hardware and was Phase A's proven-good exerciser.
 *
 * Both existed to debug a transport core that is now hardware-verified, so neither had
 * a remaining job. What is worth keeping from them is written down, not kept as code:
 * docs/ck_hardware_notes.md.
 *
 * Default (1) is in board_profile.h; override with -DDEMO_ENABLE_WM8904_AUDIO=0.
 */

