sulaolab/dspic33ck-hal-lab/src/boards/ev88g73a/main.c
/* DEMO_ENABLE_DMA_SELFTEST is DERIVED in app/app_config.h -- true when an SPI1/DMA0-1 path
 * is built, i.e. when the DMA controller and its self-test are needed. It was defined here
 * as EV88G73A_ENABLE_SPI_EXERCISER, by the same expression; it moved because the reason it is
 * derived rather than chosen (a self-test is load-bearing exactly when a DMA path exists) is
 * true of both boards, and because a profile should not be able to switch it off by hand.
 * The TDM master loopback below is the second path that note predicted would reuse the seam:
 * it streams through the same transport core on the same DMA channels. */

/*
 * DEMO_ENABLE_I2C_PROBE -- a standalone probe that reports what the I2C1 module
 * itself does with no codec attached (a clean NACK means the mechanism works). Written
 * as HW-mechanism prep before the codec was wired. See app/i2c_probe.h.
 *
 * Default 0, because it drives I2C1 and so does the WM8904 path, which is on by default
 * -- see the #error below. Enable it (and disable WM8904) to check the bus in isolation.
 *
 * The probe module itself (app/i2c_probe.c) is compiled either way, being shared; this
 * flag only decides whether this profile RUNS it. The bus bring-up it needs is
 * ev88g73a_i2c1_init(), which the WM8904 path also calls -- same bus, same pins.
 *
 * Default (0) is in board_profile.h, and the WM8904-vs-probe exclusivity that used to be
 * asserted here is one of app_config.h's checks now -- both boards need it.
 */

/*
 * DEMO_ENABLE_TDM_MASTER_LOOPBACK -- the codec-less TDM8/32-bit MASTER exerciser: dsPIC
 * SPI1 self-generates BCLK, a 50%-duty FS via CLC1, and a ramp on SDO. Claims
 * SPI1/RP48-51 and no I2C at all.
 *
 * This restores the capability the note above records as deleted on 2026-08-02
 * (DEMO_ENABLE_TDM_MASTER_LOOPBACK, "Phase A's proven-good exerciser"). It is NOT the
 * deleted code coming back: that was this board's private copy, and what runs now is the
 * shared app/demo_tdm_master_loopback.c that DM330030 already uses, with this board
 * supplying only its four pins through demo_tdm_master_loopback_port_t. The duplicate is
 * what was deleted; the exerciser is what was wanted back.
 *
 * Default 0 -- the codec path is what this board is normally for. Enable it (and the
 * WM8904 path goes off, see the #error below) when the point is to see TDM8 signals on a
 * scope with NO codec attached: nothing is required on the other end, because the master
 * is the clock source. That is also what makes it the exerciser that actually covers the
 * CLC1/fs_clc PPS path -- the codec build runs SPI1 as a SLAVE with FS_PULSE, so it never
 * engages fs_clc at all.
 *
 * Default (0) is in board_profile.h. The SPI1 exclusivity against the WM8904 path -- two
 * configured owners of one peripheral, in opposite roles, which is a build that cannot be
 * right rather than a runtime condition worth reporting -- is asserted in app_config.h.
 */

#if DEMO_ENABLE_DMA_SELFTEST
#include "dma_selftest.h"

/* Channel 3: the SPI/TDM transport owns 0 (RX) and 1 (TX) -- see
 * nora_spi_i2s_tdm_conf.h. The self-test takes the channel as an argument
 * precisely because that allocation is this profile's to know, not the test's. */
#define EV88G73A_SELFTEST_DMA_CH (NORA_DMA_CHANNEL_3)
#endif
#if DEMO_ENABLE_I2C_PROBE
#include "i2c_probe.h"

/*
 * What the shared probe needs to know about THIS board's bus. Everything here is a
 * profile or lab choice rather than probe logic, which is why the probe itself is
 * app/i2c_probe.c now:
 *
 *   - the WM8904's 7-bit address (0x34 >> 1) and its device-ID register (R0), used only
 *     as a concrete known target. This does not claim a codec is attached, and it does
 *     not depend on wm8904.c.
 *   - the bus bring-up, which is the board's (pins/pull-ups: see ev88g73a_board.c).
 *   - the pin description, because a report that does not say which wires it drove is a
 *     report nobody can act on.
 */
static const i2c_probe_t s_i2c1_probe = {
    .inst        = NORA_I2C_INST_1,
    .addr7       = 0x1Au,
    .reg_pointer = 0x00u,
    .bus_init    = ev88g73a_i2c1_init,
    .where       = "ASDA1=RP56(RC8) ASCL1=RP57(RC9), 400 kHz, no codec attached",
};
#endif
#if DEMO_ENABLE_TDM_MASTER_LOOPBACK
/*
 * ONE FLAG NOW, AND THIS IS WHERE THE TWO-FLAG TRAP USED TO BE. The shared demo's body sits
 * inside its own #if, so it has to be compiled with the same switch this profile reads --
 * and until 2026-08-05 that switch had two names: ENA_TDM_MASTER_LOOPBACK for the module
 * (app_config.h, a separate translation unit that cannot see a #define made here) and
 * EV88G73A_ENABLE_TDM_LOOPBACK for this file. A -D that set only one produced an empty
 * object and a link error, so this block carried an #error asserting the pair. There is one
 * name now, resolved in board_profile.h, so the mistake is impossible rather than diagnosed:
 *
 *     buildtools\build.ps1 -Configuration CK64MC105_EV88G73A -Full `
 *         -Define @('DEMO_ENABLE_TDM_MASTER_LOOPBACK=1','DEMO_ENABLE_WM8904_AUDIO=0')
 */

#include "demo_tdm_master_loopback.h"

/*
 * This board's half of the codec-less TDM master exerciser: the pins, and nothing else.
 * The same routing function the WM8904 path uses, in the other role -- ev88g73a_tdm_pins_init
 * takes the role precisely so one function serves both, which is what let this board's
 * private copy of the demo go (see demo_tdm_master_loopback.h).
 */
static const demo_tdm_master_loopback_port_t s_tdm_loopback_port = {
    .configure_pins = ev88g73a_tdm_pins_init,
    .wiring         = EV88G73A_TDM_LOOPBACK_WIRING_STR,
};
#endif

#if DEMO_ENABLE_WM8904_AUDIO
#include "wm8904_audio.h"
#include "app_console.h"   /* app_console_msg_t + the status codes, for *tp and *tq below */

/*
 * Phase B: a single WM8904 as passthrough audio over TDM8/32-bit. The path is shared
 * (app/wm8904_audio.c); what is below is this profile's half of it -- the wiring, and
 * the design choices the shared module cannot make for a board.
 *
 * WHICH SIDE DRIVES BCLK/FS/LRCLK IS A BUILD SWITCH, mirroring what the original sonora
 * project does: the WM8904 can be either half of the pair, and which one is chosen is a
 * build-time decision rather than something probed at runtime.
 *
 *   0 (default) -- WM8904 = master (drives BCLK/FS/LRCLK off its own X1 crystal),
 *     dsPIC SPI1 = SLAVE. Requires jumper A-XTAL. HARDWARE-TESTED including a listening
 *     pass on four paths (plan doc 18); this is the only position whose 48 000 Hz matches
 *     the AVAS coefficient tables.
 *   1 -- dsPIC SPI1 = MASTER (self-generated BCLK plus a 50%-duty FS via CLC1, the
 *     operating point the master path was scope-verified at), WM8904 = SLAVE. Requires
 *     jumper A-extMCLK. HARDWARE-TESTED 2026-08-09 (plan doc 19: passthrough ran, the
 *     codec returned ADC data locked to our FS, and the operator confirmed audio) --
 *     this line said "Desk design; not hardware-tested" until then. Transport fs is
 *     48 828.125 Hz here, so AVAS is refused by design, which is why the two jumper
 *     positions are complementary rather than alternatives.
 *
 * MASTER/SLAVE HERE IS ONLY ABOUT WHO DRIVES BCLK/FS -- it says nothing about where the
 * codec's SYSCLK comes from, and no build of either board supplies an MCLK (this firmware
 * has no MCLK output at all; see the note in ev88g73a_pins.h beside the wiring string).
 * What the A jumper physically switches is a board fact this firmware does not set and
 * has not measured: plan doc 20.4.
 */
#ifndef EV88G73A_WM8904_DSPIC_IS_MASTER
#define EV88G73A_WM8904_DSPIC_IS_MASTER 0
#endif

static const wm8904_audio_port_t s_wm8904_port = {
    .configure_pins      = ev88g73a_tdm_pins_init,
    .i2c_init            = ev88g73a_i2c1_init,      /* same bus and pins as the I2C1 probe */
    /* The .mclk_init slot is gone from wm8904_audio_port_t (2026-08-04), so there is no
     * NULL to write here any more. The note that stood in its place -- "the WM8904 board
     * here self-clocks from its own X1 ... DM330030 has to divide one out of REFO1
     * instead" -- was right at jumper A-XTAL on this board (measured: the codec masters
     * BCLK/FS at 48 000 Hz) and wrong about the other one: it is the same codec board, with
     * the same crystal. The A jumper picks which clock reaches the codec's MCLK input --
     * A-XTAL that crystal, A-extMCLK an incoming BCLK, i.e. ours (board fact, from the person
     * who wired it, 2026-08-09). So at A-extMCLK the codec is SYSCLK'd by our BRG, and what
     * this tree still lacks is only an MCLK STAGE, in either position. See ev88g73a_board.h
     * and plan doc 20.4 + 21. */
    .mute_button_pressed = ev88g73a_sw0_pressed,    /* SW0, active-low, read raw */
    /* From ev88g73a_pins.h, beside the RP numbers it describes. This line used to be a
     * hand-typed second copy of them. */
    .wiring              = EV88G73A_AUDIO_WIRING_STR,
};

static const wm8904_audio_config_t s_wm8904_audio = {
    .port            = &s_wm8904_port,
    .i2c_inst_legacy = 1u,     /* wm8904.c maps this to NORA_I2C_INST_1 */
    .dspic_is_master = (EV88G73A_WM8904_DSPIC_IS_MASTER != 0),
    /* Self-clocked BCLK = Fp/(2*(brg+1)); brg=3 at Fcy=100 MHz -> 12.5 MHz BCLK ->
     * TDM8/32-bit fs ~= 48.8 kHz, the scope-verified master operating point. Ignored in
     * the default slave build. */
    .brg             = 3u,
    /* Matches wm8904.c's own default (WM8904_SAMPLE_RATE_REG_48K at init). Revisit if
     * wm8904_set_rate_hz() is ever called for this profile. */
    .sample_rate_hz  = 48000u,
    /* Deliberately long, for demonstrating the SW0 mute ramp -- the fade is meant to be
     * obvious rather than transparent. Snapped to the nearest curve in gain_ctrl.c's table,
     * which is 791 ms at this rate; the boot banner prints both numbers so the snap is
     * visible. 300 ms (curve (6,7)) is what this board asked for before, if a ramp that
     * merely avoids the click is wanted again. */
    .gain_ramp_ms    = 800u,
    /*
     * 0 = no throttle of its own: profile_wait_next_tick() below already gates `report`
     * to EV88G73A_STATUS_PRINT_PERIOD_MS, and two periods stacked on one line means the
     * observed cadence is their product, which is the kind of arithmetic that produced
     * the 4x error recorded just below.
     */
    .status_period_ms      = 0u,
    /*
     * One "not started" reminder per 40 s -- the cadence the predecessor actually had,
     * kept as a measured number. It expressed this as "20 reports", and its comment
     * claimed that was ~10 s, having assumed the countdown ticked on every ~500 ms poll
     * when it only ticked on the ~2 s reports: wrong by 4x, and wrong in the way a count
     * of calls invites. Measured on hardware at 40 s before that merge and after it; the
     * number is what survives, now stated in the unit it was measured in.
     */
    .idle_report_period_ms = 40000u,
};

