sulaolab/dspic33ck-hal-lab/src/boards/ev88g73a/main.c
/*
 * Console module 't' (audio transport) -- runtime path and load controls, reached through
 * console_board_onmsg() in ev88g73a_console_out.c.
 *
 * WHY IT IS IN THIS FILE. The command needs s_wm8904_audio, which is the profile's
 * config and belongs beside the port struct above rather than in a console file that
 * would then have to know this board's TDM geometry. So the handler is here, next to
 * what it controls, and the board's console file only routes the letter -- the same
 * division uart_app/console_dispatch.c uses for the shared modules.
 *
 * WHY 't'. console_dispatch.c reserves it for audio transport, to keep sonora's *tr
 * meaning the same thing across the fleet. This is the first command to claim it.
 *
 *   *tp  advance the block path: gain -> copy -> mute -> gain (gain is the boot default)
 *   *tp0000..*tp0003  select one: 0 copy, 1 mute, 2 tone, 3 gain. Tone is NOT in the
 *        cycle -- it drives the output with a synthetic 1 kHz, so it is asked for by
 *        index rather than arrived at by one keystroke too many (see wm8904_audio.h)
 *   ?tp  the current path, plus what CODEC-IN carries (peak level + active slot mask)
 *   *tq0000  stop the periodic TDM1 load line;  *tq0001  resume it (on after a bring-up)
 *   ?tq  whether that line is on, plus ONE full line including last/deadline
 *   *ts  analog-mute WM8904, then halt TDM/DMA (use before flashing); ?ts reports state
 *   *tb000f which AVAS parts run: 1=carriers 2=envelope 4=gate 8=noise; ?tb reports
 *   *ti<NNNN> PRE gain, tenths of a dB, SIGNED (two's complement): *ti0000 = 0.0 dB,
 *        *ti003C = +6.0 dB, *tiFFF6 = -1.0 dB. ?ti reports it and the clamp count
 *   *to<NNNN> POST gain, same units and same grammar. ?to likewise
 *   *tc<NNNN> AVAS pitch trim, cent (not tenths), SIGNED, same two's-complement
 *        grammar as *ti and *to: *tc0000 = 0 cent, *tc00C8 = +200 cent, *tcFF38 =
 *        -200 cent. Out-of-range clamps rather than refuses (matches *ti and *to's
 *        own gain-table clamp), and the result also snaps to the nearest 5 cent
 *        -- the ratio table is only that fine (see avas_pitch_ck_table.h; it
 *        used to be 1 cent and that alone did not fit this image). ?tc reports
 *        the committed and, if different, the still-pending value, both already
 *        snapped. The up/down arrow keys move in the same 5 cent steps -- see
 *        ev88g73a_transport_console_hotkey() below
 *
 * TWO OF THESE ARE OPTIONAL: *tb/?tb and *tl are gated by
 * WM8904_AUDIO_ENABLE_TDM_DIAG (wm8904_audio.h), which a two-voice image turns off to buy
 * the program memory the second voice needs. In such an image *tb and *tl are ABSENT --
 * ERR_NOT_FOUND like any unknown letter, the same treatment *tm gets and for the same
 * reason (a "not built" reply is a string). Everything else in the list above is present in
 * every image, deliberately: see the macro's comment for which and why.
 */
void ev88g73a_transport_console_onmsg(app_console_msg_t *msg);

void ev88g73a_transport_console_onmsg(app_console_msg_t *msg)
{
    if (msg == NULL) {
        return;
    }

    /* Sonora's one-shot declick-restart experiment.  CK uses the same WM8904 strategy
     * mask around one complete stop -> configure -> start sequence; a bare *td is the
     * baseline mask 00, hence exactly the protected counterpart of *tr. */
    if (msg->name == 'd') {
        if (msg->kind == '?') {
            console_out_str(" ?td: declick restart strategy bitmask (one-shot, *td<NN>):\n"
                            "   DEFAULT(0x00) shutdown = vendor WSEQ; startup = manual\n"
                            "   bit0 0x01 ordered HP disable; bit1 0x02 warm servo\n"
                            "   bit2 0x04 soft unmute; bit3 0x08 WSEQ shutdown\n"
                            "   bit4 0x10 soft shutdown; bit5 0x20 WSEQ startup\n"
                            "   bit6 0x40 legacy quench; e.g. *td00 *td20 *td40\n");
            wm8904_audio_declick_print_status();
            msg->data_len = 0u;
            msg->status = APP_CONSOLE_OK;
            return;
        }
        if (msg->kind != '*') {
            msg->data_len = 0u;
            msg->status = APP_CONSOLE_ERR_UNSUPPORTED;
            return;
        }
        {
            /* As on Sonora, use the first supplied byte and treat no payload as 00. */
            const uint8_t mask = (msg->data_len >= 1u) ? msg->data[0] : 0x00u;
            console_out_str(" *td: declick one-shot restart mask=0x");
            console_out_hex16((uint16_t)mask);
            console_out_str("\n");
            msg->data_len = 0u;
            msg->status = wm8904_audio_restart_declick(mask)
                            ? APP_CONSOLE_OK : APP_CONSOLE_ERR_OPERATION_FAILED;
        }
        return;
    }

    if (msg->name == 'p') {
        if (msg->kind == '?') {
            wm8904_audio_path_report();
            msg->status = APP_CONSOLE_OK;
            return;
        }

        /*
         * Bare *tp cycles; *tp<NNNN> selects a path by index. The payload is optional here,
         * unlike *tq below, and that asymmetry is deliberate: a bare *tq would have to mean
         * "whichever state you are not in", while a bare *tp has an unambiguous meaning of
         * its own (advance, and say where it landed) that has been this board's habit since
         * the command existed. The indexed form exists for the one path kept out of the
         * cycle -- *tp0002, tone. Widths are a typing convention, so accept one or two
         * bytes exactly as *tq does.
         */
        if (msg->data_len == 0u) {
            wm8904_audio_path_next();
            msg->status = APP_CONSOLE_OK;
            return;
        }

        if (msg->data_len > 2u) {
            console_out_str(" *tp: value is 0000..0003, or omit it to cycle\n");
            msg->status = APP_CONSOLE_ERR_BAD_PARM_LEN;
            return;
        }

        {
            const uint16_t value =
                (msg->data_len == 2u)
                    ? (uint16_t)(((uint16_t)msg->data[0] << 8) | (uint16_t)msg->data[1])
                    : (uint16_t)msg->data[0];

            msg->status = wm8904_audio_path_set(value) ? APP_CONSOLE_OK
                                                       : APP_CONSOLE_ERR_BAD_DATA;
        }
        return;
    }

