sulaolab/dspic33ck-hal-lab/src/boards/ev88g73a/main.c
        /*
         * *tq / *tq0000 / *tq0001 -- the shared fleet on/off subset.  Sonora defines
         * a bare *tq as OFF, so CK does too: unlike a toggle, it has an unambiguous and
         * idempotent meaning.  The hex digits after the name are already decoded into
         * msg->data[] by app_console.c.
         *
         * Sonora additionally accepts *tq0002YYYY to select a telemetry period.  CK's
         * TDM1 load line has a board-profile-fixed period, so it must not accept that
         * spelling as though the requested period had taken effect.  Recognise its mode
         * word and reply UNSUPPORTED with an explanation instead of a generic length/data
         * error; automation can then distinguish "not implemented here" from bad input.
         */
        {
            uint16_t value;

            if (msg->kind != '*') {
                msg->status = APP_CONSOLE_ERR_UNSUPPORTED;
                return;
            }

            if (msg->data_len == 0u) {
                wm8904_audio_load_line_set(false);
                msg->status = APP_CONSOLE_OK;
                return;
            }

            value = (msg->data_len >= 2u)
                        ? (uint16_t)(((uint16_t)msg->data[0] << 8) | (uint16_t)msg->data[1])
                        : (uint16_t)msg->data[0];

            if (value == 2u) {
                console_out_str(" *tq0002YYYY: telemetry-period selection is unsupported; "
                                "CK TDM1 uses its board-profile-fixed period\n");
                msg->status = APP_CONSOLE_ERR_UNSUPPORTED;
                return;
            }

            if (msg->data_len > 2u) {
                console_out_str(" *tq: takes no period -- use *tq or *tq0000 = off, "
                                "*tq0001 = on\n");
                msg->status = APP_CONSOLE_ERR_BAD_PARM_LEN;
                return;
            }

            if (value > 1u) {
                console_out_str(" *tq: value must be 0000 or 0001 (or omit it for off)\n");
                msg->status = APP_CONSOLE_ERR_BAD_DATA;
                return;
            }

            wm8904_audio_load_line_set(value != 0u);
        }
        msg->status = APP_CONSOLE_OK;
        return;
    }

    if (msg->name == 's') {
        /*
         * Keep the stop command argument-free.  It is used immediately before
         * flashing, where a typo must not be interpreted as a mode or a hidden
         * restart request.  `?ts` shares the same grammar and reports only.
         */
        if (msg->data_len != 0u) {
            console_out_str(" *ts/?ts: takes no value\n");
            msg->status = APP_CONSOLE_ERR_BAD_PARM_LEN;
            return;
        }

        if (msg->kind == '?') {
            wm8904_audio_stop_report();
        } else {
            wm8904_audio_stop();
        }
        msg->status = APP_CONSOLE_OK;
        return;
    }

    /*
     * 'r' -- restart the stream with no reset, the same letter and meaning as sonora's *tr.
     * console_dispatch.c reserved 't' for exactly this and CK had nothing behind it, so *ts
     * was terminal until a reprogram; the transport's close() -> open() -> inst_start()
     * lifecycle was simply unreachable from this console.
     *
     * Argument-free for the same reason *ts is -- and unlike *ts it is not a pre-flash
     * command, so the risk it guards against is the opposite one: a stray payload must not
     * turn "restart" into a mode. OPERATION_FAILED rather than NOT_FOUND when the path does
     * not come back, because reading those two apart is what separates "this firmware lacks
     * the command" from "the transport failed to restart" -- the distinction that briefly
     * made an unimplemented *tr look like a phase-1 regression.
     */
    if (msg->name == 'r') {
        if (msg->data_len != 0u) {
            console_out_str(" *tr: takes no value\n");
            msg->status = APP_CONSOLE_ERR_BAD_PARM_LEN;
            return;
        }
        if (msg->kind == '?') {
            console_out_str(" ?tr: no query form -- ?ts reports the state\n");
            msg->status = APP_CONSOLE_ERR_UNSUPPORTED;
            return;
        }

        msg->status = wm8904_audio_restart() ? APP_CONSOLE_OK
                                            : APP_CONSOLE_ERR_OPERATION_FAILED;
        return;
    }

    /*
     * 'l' -- the transport's lifecycle GATES, attempted where they must refuse. Not a load
     * command ('q' owns the load line): l is for lifecycle.
     *
     * RUN IT IN BOTH STATES -- *tl, then *ts, then *tl again, then *tr -- because the four
     * expectations are state-dependent and each state contains one call that must SUCCEED.
     * A single run in one state cannot tell a working gate from a bool that never varies,
     * which is the whole reason this command exists (wm8904_audio.h, and §12 of the
     * alignment plan). No query form: it performs HAL calls, so it is a '*' command even
     * though all it produces is a report.
     */
#if WM8904_AUDIO_ENABLE_TDM_DIAG
    if (msg->name == 'l') {
        if (msg->data_len != 0u) {
            console_out_str(" *tl: takes no value\n");
            msg->status = APP_CONSOLE_ERR_BAD_PARM_LEN;
            return;
        }
        if (msg->kind == '?') {
            console_out_str(" ?tl: no query form -- *tl performs the calls it reports\n");
            msg->status = APP_CONSOLE_ERR_UNSUPPORTED;
            return;
        }

        msg->status = wm8904_audio_lifecycle_probe() ? APP_CONSOLE_OK
                                                    : APP_CONSOLE_ERR_OPERATION_FAILED;
        return;
    }
#endif /* WM8904_AUDIO_ENABLE_TDM_DIAG -- *tl, absent like *tm rather than refused */

#if WM8904_AUDIO_ENABLE_SYSTEM_PROBE
    /*
     * 'm' -- the SYSTEM / sync-domain API (phase 4). m is for mode: the ownership mode this
     * command is the only way to observe, since it is a file-static inside the HAL.
     *
     * ALSO RUN IT IN BOTH STATES (*tm, *ts, *tm, *tr): 5 rejections while running, then the
     * 14-step round trip while stopped, which is where arm-all-then-go actually executes.
     * Without this command the linker discards the whole domain API and phase 4 ships as code
     * that has never run (F3 in the alignment plan). It restores SINGLE before returning --
     * mandatory, because under SYSTEM *ts itself is gated off.
     *
     * LAB IMAGES ONLY, and the letter is not merely hidden -- it is ABSENT, falling through to
     * ERR_NOT_FOUND like any unknown letter. A production "not implemented" reply would cost a
     * string, which is the thing this gate exists to buy back. See the macro in wm8904_audio.h;
     * the same clause discards the domain API, so in a production image there is nothing under
     * this command to reach.
     */
    if (msg->name == 'm') {
        if (msg->data_len != 0u) {
            console_out_str(" *tm: takes no value\n");
            msg->status = APP_CONSOLE_ERR_BAD_PARM_LEN;
            return;
        }
        if (msg->kind == '?') {
            console_out_str(" ?tm: no query form -- *tm performs the calls it reports\n");
            msg->status = APP_CONSOLE_ERR_UNSUPPORTED;
            return;
        }

        msg->status = wm8904_audio_system_probe() ? APP_CONSOLE_OK
                                                 : APP_CONSOLE_ERR_OPERATION_FAILED;
        return;
    }
#endif /* WM8904_AUDIO_ENABLE_SYSTEM_PROBE */

    msg->status = APP_CONSOLE_ERR_NOT_FOUND;
}

