sulaolab/dspic33ck-hal-lab/src/boards/ev88g73a/main.c
/*
 * Sonora Classic owns `*cy SS` as its synth-group command.  Its 00 subcode is
 * specifically the Type_TY AVAS hotkey -- not a generic "whichever AVAS voice is
 * selected" toggle.  CK has the same Type_TY action behind `a`, so accept the
 * structured spelling as well and send it through the same voice-key entry point.
 * That preserves the exclusive-voice and fade behaviour instead of manufacturing a
 * second enable flag beside the compatibility command.
 */
void ev88g73a_classic_console_onmsg(app_console_msg_t *msg)
{
    uint8_t subcode;

    if (msg == NULL) {
        return;
    }

    if (msg->name != 'y') {
        msg->status = APP_CONSOLE_ERR_NOT_FOUND;
        return;
    }

    if (msg->kind != '*') {
        console_out_str(" ?cy: no query form -- *cy00 toggles the Type_TY AVAS voice\n");
        msg->status = APP_CONSOLE_ERR_UNSUPPORTED;
        return;
    }

    if (msg->data_len != 1u) {
        console_out_str(" *cy: needs one synth subcode -- 00 = Type_TY AVAS toggle\n");
        msg->status = APP_CONSOLE_ERR_BAD_DATA;
        return;
    }

    subcode = msg->data[0];
    if (subcode == 0u) {
        console_out_str(" *cy00: Type_TY AVAS toggle\n");
        wm8904_audio_avas_voice_key((uint8_t)WM8904_AUDIO_AVAS_VOICE_TYPE_TY);
        msg->status = APP_CONSOLE_OK;
        return;
    }

    if (subcode <= 4u) {
        console_out_str(" *cy: Sonora synth subcode is unsupported on CK (only 00 = Type_TY AVAS)\n");
        msg->status = APP_CONSOLE_ERR_UNSUPPORTED;
        return;
    }

    console_out_str(" *cy: unknown synth subcode\n");
    msg->status = APP_CONSOLE_ERR_BAD_DATA;
}

/*
 * Single-key hotkeys for this board, reached through console_board_hotkey() in
 * ev88g73a_console_out.c. Two keys, and they are ONE VOICE EACH rather than a key for
 * the engine plus a key for the selection: 'a' = Type_TY L1, 'A' = Type_LB L3,
 * fully exclusive at run time. Pressing the letter of the voice that is sounding stops
 * it; pressing the other one's letter refuses and says why, because a switch re-seeds
 * every oscillator and mid-sound that is a click. Both letters go through the one
 * entry point wm8904_audio_avas_voice_key() so they cannot come to mean different
 * shapes of thing -- see wm8904_audio.h, where the rule and sonora's precedent are.
 *
 * A ONE-VOICE IMAGE STILL BINDS BOTH, deliberately: 'A' there prints that the image
 * holds only the other voice and how to build one that holds both. A key that does
 * nothing is indistinguishable from a console that stopped listening, which on this
 * board is a real failure mode and not a hypothetical one.
 *
 * 'a' -- start/stop the AVAS synth, no Enter. sonora binds the same letter to the same
 * engine (apps/classic/classic_console.c: case 'a' -> UsrOperate_avas_synth()), and
 * matching it is the whole point: the two boards are listened to in one session, by ear,
 * switching back and forth, and a different key on each is a mistake waiting for the
 * moment your attention is on the sound instead of the keyboard. Since the synth became a
 * stage of the chain path, what this key does matches sonora too: a START from silence
 * begins at t = 0 of the reference and opens over 4 s, and a STOP fades out over ~3 s
 * instead of cutting -- pressed again during that fade it resumes without a phase reset,
 * which is sonora's rule and the reason a jump there would click.
 *
 * It is intentionally a bare toggle: measured cost is 289.2 us of a 667 us block
 * (43.0 %, miss = 0, 382.2 us margin), so the same direct interaction Sonora offers is
 * safe here. State remains in the audio module, rather than a duplicate flag beside the
 * key, so the two voice keys cannot drift apart.
 *
 * UP/DOWN ARROW -- AVAS pitch trim, +-5 cent per press (see wm8904_audio_avas_pitch_step()
 * and the module comment's *tc entry). A terminal sends an arrow as three bytes, the ANSI
 * CSI sequence ESC '[' 'A' (up) or ESC '[' 'B' (down), so this needs a tiny state machine
 * across calls rather than a single-byte match. app_console.c has no ESC handling of its
 * own (checked: nothing else on this board interprets 0x1B), so there is nothing to
 * collide with.
 *
 * 'A' NAMES TWO DIFFERENT THINGS -- Type_LB start/stop bare, and "pitch up" after
 * ESC '['. They cannot be confused because the state machine only reaches the arrow
 * branch after actually seeing ESC '[' first; a bare 'A' with the state machine idle
 * falls straight through to the existing case below, unchanged.
 *
 * UNRECOGNISED BYTES AFTER ESC ARE SWALLOWED, not handed to the line parser: this board
 * has no other use for ESC, and passing a half-consumed CSI sequence into a '*'/'?' line
 * would just start a line that can never parse, sitting there until the user notices
 * nothing is echoing.
 */
bool ev88g73a_transport_console_hotkey(uint8_t ch)
{
    static uint8_t s_esc_state; /* 0 = idle, 1 = saw ESC, 2 = saw ESC '[' */

    if (s_esc_state == 2u) {
        s_esc_state = 0u;
        if (ch == (uint8_t)'A') {
            wm8904_audio_avas_pitch_step(+5);
            return true;
        }
        if (ch == (uint8_t)'B') {
            wm8904_audio_avas_pitch_step(-5);
            return true;
        }
        return true;   /* some other CSI final byte -- swallow it, see above */
    }

    if (s_esc_state == 1u) {
        s_esc_state = (ch == (uint8_t)'[') ? 2u : 0u;
        return true;
    }

    if (ch == 0x1Bu) {
        s_esc_state = 1u;
        return true;
    }

    if (ch == (uint8_t)'a') {
        wm8904_audio_avas_voice_key((uint8_t)WM8904_AUDIO_AVAS_VOICE_TYPE_TY);
        return true;
    }

    if (ch == (uint8_t)'A') {
        wm8904_audio_avas_voice_key((uint8_t)WM8904_AUDIO_AVAS_VOICE_TYPE_LB);
        return true;
    }

    return false;
}
#endif

/*
 * LED0 blink, and a standing check on the clock.
 * ----------------------------------------------
 * Timing comes from Timer1, not a software delay loop, so the period is exact in Fcy
 * terms. A `while (count--) nop;` loop costs an unknown, compiler- and -O-dependent
 * number of cycles per iteration; that unknown multiplies into the elapsed time and is
 * indistinguishable from a clock error.
 *
 * SINCE 2026-08-03 THIS FILE NO LONGER OWNS TIMER1. It used to program T1CON/PR1 here
 * directly for a 100 ms period and poll IFS0bits.T1IF, with interrupts disabled -- so
 * this profile had a timer and no running time, and every cadence in it was expressed as
 * a COUNT OF 100 ms periods. app/timer_app.c now owns the timer and the vector, and the
 * cadences below are milliseconds against GetTicks().
 *
 * WHAT SURVIVES THE MOVE, AND HAD TO: the tick is clocked from the peripheral clock
 * (Fp = Fcy) and told the ASSUMED target Fcy as a compile-time constant, deliberately not
 * nora_clock_get_fcy_hz(). Using the HAL's own belief would self-correct and mask a
 * wrong operating point; against a fixed constant every GetTicks() millisecond is a
 * measurement of the real clock, and the blink is how you read it:
 *
 *     actual Fcy = EV88G73A_ASSUMED_FCY_HZ * 10 / (seconds for 10 cycles)
 *
 * One full ON->OFF->ON cycle is 1.000 s exactly when Fcy is on target. Verified on
 * hardware 2026-07-28: 10 cycles in 10 s, i.e. Fcy = 100 MHz. This is how the half-speed
 * clock behind the original garbled console was caught (it read 10 cycles in ~18-20 s),
 * and it is cheap to keep as a regression check -- the console cannot report a clock error
 * that breaks the console itself. A tick that fell back to the FRC instead would show up
 * as an obviously wrong blink (8 MHz vs 100 MHz), not as a silently correct one, which is
 * why timer_app offers the two clock sources as separate calls.
 *
 * The 1 ms period is exact at this Fcy: 100 MHz / 8 (prescale) / 1000 = 12500 counts,
 * PR1 = 12499. timer_app_start_from_fcy() refuses inexact divisors rather than rounding,
 * so a future operating point that cannot make a whole millisecond says so at bring-up.
 */
#define EV88G73A_ASSUMED_FCY_HZ (EV88G73A_TARGET_FOSC_HZ / 2UL)  /* 100 MHz */

