sulaolab/dspic33ck-hal-lab/src/boards/ev88g73a/main.c
/* -------------------------------------------------------------------------- */
/* Profile hooks -- see src/profile_main.h. The four-phase sequence these      */
/* implement used to be written out inline in this file, in its own main();    */
/* the sequence now lives once in src/main.c and is shared with dm330030.      */
/* -------------------------------------------------------------------------- */

/*
 * Recorded rather than acted on, like every other bring-up result on this board
 * (g_ev88g73a_*_init_ok): profile_report() runs after the console exists, so a tick that
 * did not start can SAY so. Failing hard here would be a silent hang before the first
 * character -- and the tick not starting does not stop the console, the trap report or the
 * operating-point dump, which are the things a person is reading at that moment.
 *
 * It does stop everything paced by GetTicks(), which is why it is worth a line: the
 * symptom, otherwise, is a dark LED and a loop that never advances, and that looks
 * exactly like a clock fault.
 */
static volatile bool g_ev88g73a_tick_start_ok;

void profile_bring_up(void)
{
    ev88g73a_board_init();

    /*
     * The running time, clocked from Fp = Fcy at the ASSUMED operating point -- see the
     * LED0-blink block comment for why the constant and not nora_clock_get_fcy_hz().
     * Before board_init would be wrong: Timer1 counts the peripheral clock, so the clock
     * stage has to have run.
     */
    g_ev88g73a_tick_start_ok = timer_app_start_from_fcy(EV88G73A_ASSUMED_FCY_HZ);
}

void profile_report(void)
{
    report_operating_point();

    if (!g_ev88g73a_tick_start_ok) {
        console_out_str(
            "1 ms tick FAILED to start -- LED0 will not blink and every timed poll is "
            "stopped (console still works)\n");
    }

    /* Before the help line, so a trap report is the first thing after the
     * operating point rather than being buried under it. Silent on a clean
     * boot. */
    app_traps_report_previous();

#if DEMO_ENABLE_CONSOLE_COMMANDS
    console_task_init();
    console_task_print_help();
#endif
}

void profile_start(void)
{
#if DEMO_ENABLE_DMA_SELFTEST
    /*
     * Prove the DMA controller in isolation BEFORE any SPI work, so a stream that
     * does not run can be attributed without a second flash cycle: PASS means the
     * controller moves data and a fault is on the trigger/peripheral side; FAIL
     * means stop investigating the SPI. This ordering distinguishes a transport
     * failure from a payload-layout failure.
     *
     * It REPORTS, it no longer gates. It used to skip the stage A/B/B2/C0 harness
     * on failure, and that gate was worth having because running those stages
     * against a controller known not to move data produces failures whose cause is
     * already known. Those stages were deleted with ev88g73a_spi_dma_min.c, so
     * there is nothing left to skip -- the exercisers that remain stream
     * continuously and are judged on `miss` and the load figures instead.
     */
    if (!dma_selftest_run(EV88G73A_SELFTEST_DMA_CH)) {
        console_out_str(
            "DMA selftest FAILED -- treat the exerciser output below as "
            "uninterpretable\n");
    }
#endif

#if DEMO_ENABLE_I2C_PROBE
    /* One-shot at boot. Mutually exclusive with the WM8904 path, which drives the
     * same bus -- see the #error above. */
    i2c_probe_run(&s_i2c1_probe);
#endif

#if DEMO_ENABLE_TDM_MASTER_LOOPBACK
    /* Codec-less TDM8/32-bit MASTER: self-clocked BCLK/FS/SDO. Needs nothing on the
     * other end -- see the port above and the note on the enable flag. */
    demo_tdm_master_loopback_start(&s_tdm_loopback_port);
#endif

#if DEMO_ENABLE_WM8904_AUDIO
    /*
     * MUST come immediately before the start below, and there is no console letter for it:
     * it probes the transport while NOTHING has been configured yet (mode == NONE), and
     * inst_configure() inside start() makes that state unreachable for the rest of the
     * session -- close() does not reset the mode. Guaranteed to be the first configure on
     * this board because app_config.h #errors if the loopback demo is enabled too.
     *
     * Gated with *tl: same subject, same probe_*() output, and the same argument for
     * dropping it (see WM8904_AUDIO_ENABLE_TDM_DIAG). It is the one item in the gate that
     * runs unasked at every boot, so a diag-less image is also three console lines quieter.
     */
#if WM8904_AUDIO_ENABLE_TDM_DIAG
    (void)wm8904_audio_lifecycle_probe_unconfigured();
#endif

    /* Phase B: real WM8904 codec over TDM8/32-bit. See the port/config above. */
    wm8904_audio_start(&s_wm8904_audio);
    /*
     * Said here rather than in console_task_print_help(), which is the shared help and
     * has no business naming one board's key. The hotkey is registered by this file, so
     * this is the one place where the key and its announcement cannot drift apart --
     * which is the same rule console_task.h states about the boot help and ?gh.
     */
    console_out_str("      'a' / 'A' alone (no Enter) start-stop the AVAS synth's"
                    " type_ty / type_lb voice, exclusive (stop fades out over ~3 s);"
                    " Classic *cy00 is the Type_TY structured toggle\n");
#endif
}

/*
 * Every enabled exerciser is polled on EVERY call; `report` only decides whether
 * each one PRINTS. That split is why report is a parameter -- see the note in
 * src/profile_main.h. The I2C1 probe in particular must run its transaction each
 * time regardless, so a scope on ASDA1/ASCL1 keeps getting a fresh
 * START/ADDR/NACK to trigger on rather than one burst at boot.
 */
void profile_poll(bool report)
{
#if DEMO_ENABLE_I2C_PROBE
    i2c_probe_poll(&s_i2c1_probe, report);
#endif

#if DEMO_ENABLE_TDM_MASTER_LOOPBACK
    /* Takes no `report`: the shared demo throttles its own status line. */
    demo_tdm_master_loopback_poll();
#endif

#if DEMO_ENABLE_WM8904_AUDIO
    wm8904_audio_poll(report);
#endif

#if !DEMO_ENABLE_I2C_PROBE && !DEMO_ENABLE_WM8904_AUDIO && \
    !DEMO_ENABLE_TDM_MASTER_LOOPBACK
    /* A build with every exerciser disabled -- the LED/UART baseline. Still a
     * valid image: the LED keeps blinking and the console keeps answering. */
    (void)report;
#endif
}

